InformationRegisters/РаботаСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботаСКандидатами</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтапРаботы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЭтапРаботыСКандидатами</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеЭтапа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭтаповРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтклоненияКандидатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронь</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьВидеоконференции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиВидеоконференций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВидеоконференции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РешениеОПриемеНаРаботу</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуСписком</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыТранспортаУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыТранспортаУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Email</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыОпределенияМоментаУведомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияМоментаУведомления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдновременноССобытием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеСобытия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЕдиницыИзмеренияИнтервалаУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмеренияИнтервалаУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияЭтаповРаботыСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияЭтаповРаботыСКандидатами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пройден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропущен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ШаблоныСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецШаблона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецШаблонаСообщения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВТранслите</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяТипаПараметраВводаНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляВводаНаОсновании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляЭлектронныхПисем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаSMS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПисьмаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекстаПисьма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРедактированияЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранслитерироватьИменаФайлов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковатьВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВложений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПоВнешнейОбработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормыИВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РассылкиУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>РассылкиУведомлений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидУведомления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияМоментаУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияМоментаУведомления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалУведомления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияИнтервалаУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияИнтервалаУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкземплярТипаПредмета</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомленийФиксированные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПолучательУведомлений</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтактнойИнформации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонСообщения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомленийДинамические</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтактнойИнформации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонСообщения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПодборПерсоналаУведомления/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//	Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//										общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.3";
	Обработчик.Процедура = "ПодборПерсоналаУведомления.ПриНачальномЗаполненииДанныхПодсистемыУведомлений";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d0fd7ea9-2c31-11ec-8394-b37f065f6494");
	Обработчик.Комментарий = НСтр("ru = 'Начальное заполнение данных системы уведомлений: подбор персонала.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.3";
	Обработчик.Процедура = "ПодборПерсоналаУведомления.ОбновитьРассылкуСШаблономПредстоящегоСобеседованияSMS";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("813c468c-00e4-4371-a79d-6632a007bb57");
	Обработчик.Комментарий = НСтр("ru = 'Обновление рассылки уведомления с шаблоном предстоящего собеседования по SMS.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.3";
	Обработчик.Процедура = "Обработки.МакетыШаблоновСообщений.СформироватьРассылкуСШаблономПредстоящегоСобеседованияПисьмо";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("be893184-774f-44db-ad78-38a361ee1b13");
	Обработчик.Комментарий = НСтр("ru = 'Формирование рассылки уведомления с шаблоном предстоящего собеседования по почте.'");
	
КонецПроцедуры

// Процедура выполняет начальное заполнение данных подсистемы уведомлений
//
// Параметры:
//  ПараметрыОбновления  - Структура - описывает текущие параметры обновления
//
Процедура ПриНачальномЗаполненииДанныхПодсистемыУведомлений(ПараметрыОбновления = Неопределено) Экспорт

	ПриНачальномЗаполненииЭтапРаботыСКандидатом();
	ПриНачальномЗаполненииНоваяЗадачаИсполнителя();
	ПриНачальномЗаполненииИстечениеСрокаИсполненияЗадачи();
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура позволяет дополнить структуру видов уведомлений своими видами уведомлений. 
//
// Параметры:
//  СтруктураДоступныхВидовУведомлений - структура - перечень уведомлений, подключенных в подсистеме
//     * Ключ - Строка - Имя вида уведомления
//     * Значение - Структура - Описание вида уведомления (Структура)
//        * ВидУведомления - Строка, строковый идентификатор вида уведомления.
//        * Описание - Строка, Текстовое описание получаемых данных. Доступно пользователю в справочнике Видов уведомлений.
//        * Инициализация - Строка, <ИмяМодуля>.<ИмяПроцедуры> описывающей данные вида уведомления без выполнения
//                          запросов к базе данных.
//        * ПолучениеДанных - Строка, <ИмяМодуля>.<ИмяПроцедуры> выполняемой для получения данных уведомления.
//
Процедура ПриЗаполненииСпискаВидовУведомлений(СтруктураДоступныхВидовУведомлений) Экспорт
	
	ОписаниеВидаУведомления = УведомленияСервер.ПустоеОписаниеВидаУведомления();
	ОписаниеВидаУведомления.ВидУведомления = НСтр("ru = 'Назначен этап работы с кандидатом'");
	ОписаниеВидаУведомления.GUID = "1d20ba56-3fe2-4c74-bd98-5a94ab3ef618";
	ОписаниеВидаУведомления.Описание = НСтр("ru = 'Уведомление о назначенном этапе работы с кандидатом.'");
	ОписаниеВидаУведомления.Инициализация = "ПодборПерсоналаУведомления.ИнициализацияУведомлениеОбЭтапеРаботыСКандидатом";
	ОписаниеВидаУведомления.ПолучениеДанных = "ПодборПерсоналаУведомления.ПолучениеДанныхУведомлениеОбЭтапеРаботыСКандидатом";
	
	СтруктураДоступныхВидовУведомлений.Вставить("ЭтапРаботыСКандидатом", ОписаниеВидаУведомления);
	
	ОписаниеВидаУведомления = УведомленияСервер.ПустоеОписаниеВидаУведомления();
	ОписаниеВидаУведомления.ВидУведомления = НСтр("ru = 'Назначена новая задача'");
	ОписаниеВидаУведомления.GUID = "9a4441d5-19ea-11ec-837d-a0508b2abe9d";
	ОписаниеВидаУведомления.Описание = НСтр("ru = 'Уведомление о назначении новой задачи исполнителя.'");
	ОписаниеВидаУведомления.Инициализация = "ПодборПерсоналаУведомления.ИнициализацияВидаУведомленияНоваяЗадачаИсполнителя";
	ОписаниеВидаУведомления.ПолучениеДанных = "ПодборПерсоналаУведомления.ПолучениеДанныхВидаУведомленияНоваяЗадачаИсполнителя";
	
	СтруктураДоступныхВидовУведомлений.Вставить("НоваяЗадачаИсполнителя", ОписаниеВидаУведомления);
	
	ОписаниеВидаУведомления = УведомленияСервер.ПустоеОписаниеВидаУведомления();
	ОписаниеВидаУведомления.ВидУведомления = НСтр("ru = 'Истечение срока исполнения задачи'");
	ОписаниеВидаУведомления.GUID = "9a4441d6-19ea-11ec-837d-a0508b2abe9d";
	ОписаниеВидаУведомления.Описание = НСтр("ru = 'Уведомления об истечении срока задачи исполнителя.'");
	ОписаниеВидаУведомления.Инициализация = "ПодборПерсоналаУведомления.ИнициализацияВидаУведомленияИстечениеСрокаИсполненияЗадачи";
	ОписаниеВидаУведомления.ПолучениеДанных = "ПодборПерсоналаУведомления.ПолучениеДанныхВидаУведомленияИстечениеСрокаИсполненияЗадачи";
	
	СтруктураДоступныхВидовУведомлений.Вставить("ИстечениеСрокаИсполненияЗадачи", ОписаниеВидаУведомления);
	
КонецПроцедуры

// Процедура выполняет обновление шаблона предстоящего собеседования
//
Процедура ОбновитьРассылкуСШаблономПредстоящегоСобеседованияSMS(ПараметрыОбновления = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ШаблоныСообщений");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		
		ИмяШаблонаРассылки = НСтр("ru='Уведомление кандидату о собеседовании'");
		ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблонаРассылки, Истина);
		РассылкаСсылка = Справочники.РассылкиУведомлений.НайтиПоНаименованию(ИмяШаблонаРассылки, Истина);
		Наименование = НСтр("ru='Уведомление о предстоящем собеседовании (SMS)'");
		
		Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
			ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
			ШаблонОбъект.Наименование = Наименование;
			// АПК:1223-выкл. Личные местоимения используются в текстах шаблонов
			ШаблонОбъект.ТекстШаблонаSMS = НСтр("ru='[Кандидаты.ФизическоеЛицо.Имя] [Кандидаты.ФизическоеЛицо.Отчество]! Напоминаем, что вы приглашены на [ДанныеУведомления.ЭтапРаботы], которое состоится [ДанныеУведомления.ДатаСобытия{ДЛФ=D}] в [ДанныеУведомления.ВремяСобытия].
			|С уважением, [ДанныеУведомления.ОтветственныйПоРаботеСКандидатом]'");
			// АПК:1223-вкл.
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонОбъект, Ложь, Ложь);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РассылкаСсылка) Тогда
			РассылкаОбъект = РассылкаСсылка.ПолучитьОбъект();
			РассылкаОбъект.Наименование = Наименование;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при подготовке шаблонов сообщений и позволяет заполнить поля, доступные для шаблона
//  соответствующего вида уведомлений.
//
// Параметры:
//  ВидУведомления           - СправочникСсылка.ВидУведомления - вид уведомления - владелец шаблона
//  Реквизиты                - ДеревоЗначений - список реквизитов шаблона.
//         ** Имя            - Строка - Уникальное имя общего реквизита.
//         ** Представление  - Строка - Представление общего реквизита.
//         ** Тип            - Тип    - Тип реквизита. По умолчанию строка.
//         ** Формат         - Строка - Формат вывода значения для чисел, дат, строк и булевых значений.
//                                      и др.
//  Вложения                - ТаблицаЗначений - печатные формы и вложения
//         ** Имя            - Строка - Уникальное имя вложения.
//         ** Представление  - Строка - Представление варианта.
//         ** ТипФайла       - Строка - Тип вложения, который соответствует расширению файла: "pdf", "png", "jpg", mxl"
//                                      и др.
//  НазначениеШаблона        - Строка  - Имя назначения шаблон сообщения.
//  ДополнительныеПараметры  - Структура - дополнительные сведения о шаблоне сообщений.
//
Процедура ПриПодготовкеШаблонаСообщенияПоУведомлению(ВидУведомления, Реквизиты, Вложения, НазначениеШаблона, ДополнительныеПараметры) Экспорт
	
	Если ВидУведомления = Справочники.ВидыУведомлений.НайтиПоРеквизиту("Имя", "ЭтапРаботыСКандидатом") Тогда
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ДатаСобытия",НСтр("ru='Дата и время события'"), Новый ОписаниеТипов("Дата"), "ДФ='dd.MM.yyyy HH:mm'");
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ДатаСобытияПредставление",НСтр("ru='Дата события'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ВремяСобытия",НСтр("ru='Время события'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Предмет",НСтр("ru='Кандидат'"), Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ЭтапРаботы",НСтр("ru='Этап работы'"), Новый ОписаниеТипов("СправочникСсылка.ЭтапыРаботыСКандидатами"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.СостояниеЭтапа",НСтр("ru='Состояние этапа'"), Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЭтаповРаботыСКандидатами"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ПериодОкончание",НСтр("ru='Окончание'"), Новый ОписаниеТипов("Дата"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Комментарий",НСтр("ru='Комментарий по кандидату'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Вакансия",НСтр("ru='Вакансия'"), Новый ОписаниеТипов("СправочникСсылка.Вакансии"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ОтветственныйПоРаботеСКандидатом",НСтр("ru='Ответственный по кандидату'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ОтветственныйПоВакансии",НСтр("ru='Ответственный по вакансии'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ЦелеваяПозиция",НСтр("ru='Целевая позиция'"), Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ЦелевоеПодразделение",НСтр("ru='Целевое подразделение'"), Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ИначеЕсли ВидУведомления = Справочники.ВидыУведомлений.НайтиПоРеквизиту("Имя", "НоваяЗадачаИсполнителя") Тогда
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ДатаНазначения", НСтр("ru = 'Дата и время назначения задачи'"), Новый ОписаниеТипов("Дата"), "ДФ='dd.MM.yyyy HH:mm'");
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ДатаНазначенияПредставление", НСтр("ru = 'Дата назначения задачи'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ВремяНазначенияПредставление", НСтр("ru = 'Время назначения задачи'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.СрокИсполнения", НСтр("ru = 'Срок исполнения задачи'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Важность", НСтр("ru = 'Важность'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Автор", НСтр("ru = 'Автор'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Описание", НСтр("ru = 'Описание'"), Новый ОписаниеТипов("Строка"));
	ИначеЕсли ВидУведомления = Справочники.ВидыУведомлений.НайтиПоРеквизиту("Имя", "ИстечениеСрокаИсполненияЗадачи") Тогда
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ДатаНазначения", НСтр("ru = 'Дата и время назначения задачи'"), Новый ОписаниеТипов("Дата"), "ДФ='dd.MM.yyyy HH:mm'");
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ДатаНазначенияПредставление", НСтр("ru = 'Дата назначения задачи'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ВремяНазначенияПредставление", НСтр("ru = 'Время назначения задачи'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.СрокИсполнения", НСтр("ru = 'Срок исполнения задачи'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Важность", НСтр("ru = 'Важность'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Автор", НСтр("ru = 'Автор'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Описание", НСтр("ru = 'Описание'"), Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
КонецПроцедуры

// Заполняет параметры вида уведомления "Назначено собеседование"
// 
// Параметры:
//  ОписаниеДанных - Структура - Содержит элементы, описывающий вид уведомления
//    * ТипПредмета - ОписаниеТипов - указывает тип предмета уведомления
//    * Отборы - ТаблицаЗначений - описывает отборы, которые будут доступны пользователю, при настройке рассылки
//        * Имя - Строка - Имя поля отбора, должно быть уникально в пределах таблицы отборов
//                         и совпадать с одним из полей данных уведомления
//        * Представление - Строка - пользовательское представление поля отбора
//        * ОписаниеТипов - ОписаниеТипов - тип значения отбора
//    * Получатели - ТаблицаЗначений - описывает получателей, предлагаемых разработчиком.
//                                 Значение получателей будет выбрано из данных уведомления
//        * Имя - Строка - Имя поля получателя, должно быть уникально в пределах таблицы отборов
//                         и совпадать с одним из полей данных уведомления
//        * Представление - Строка - пользовательское представление получателя
//        * ОписаниеТипов - ОписаниеТипов - тип значения получателя
//
Процедура ИнициализацияУведомлениеОбЭтапеРаботыСКандидатом(ОписаниеДанных) Экспорт
	
	ОписаниеДанных.ТипПредмета = Новый ОписаниеТипов("СправочникСсылка.Кандидаты");
	
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "Предмет", НСтр("ru='Кандидат'"), Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "ОтветственныйПоРаботеСКандидатом", НСтр("ru='Ответственный по работе с кандидатом'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "ОтветственныйПоВакансии", НСтр("ru='Ответственный по вакансии'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "ЭтапРаботы", НСтр("ru='Этап работы'"), Новый ОписаниеТипов("СправочникСсылка.ЭтапыРаботыСКандидатами"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "СостояниеЭтапа", НСтр("ru='Состояние этапа'"), Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЭтаповРаботыСКандидатами"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "ЦелеваяПозиция", НСтр("ru='Целевая позиция'"), Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "ЦелевоеПодразделение", НСтр("ru='Целевое подразделение'"), Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Предмет", 	НСтр("ru = 'Кандидат'"), Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
	
КонецПроцедуры

// Процедура заполняет таблицу уведомлений по переданным параметрам и отборам.
//
// Параметры:
//    СтруктураПериода - Структура - два элемента - НачалоПериода и ОкончаниеПериода
//    Отборы - ТаблицаЗначений - перечень отборов событий, заданный пользователем
//       * ЛевоеЗначение - Строка - имя поля отбора в источнике данных.
//       * ВидСравнения - ВидСравнения - Вид сравнения
//       * ЛевоеЗначение - Булево, Число, Строка, Дата, ЛюбаяСсылка - значение отбора.
//    ТаблицаРезультата - ТаблицаЗначений - содержит события изменения объекта.
//
Процедура ПолучениеДанныхУведомлениеОбЭтапеРаботыСКандидатом(СтруктураПериода, Отборы, ТаблицаРезультата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПериода.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", СтруктураПериода.ОкончаниеПериода);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	РаботаСКандидатами.Период КАК ДатаСобытия,
	|	"""" КАК ДатаСобытияПредставление,
	|	РаботаСКандидатами.Кандидат КАК Предмет,
	|	РаботаСКандидатами.ЭтапРаботы КАК ЭтапРаботы,
	|	РаботаСКандидатами.СостояниеЭтапа КАК СостояниеЭтапа,
	|	РаботаСКандидатами.ПериодОкончание КАК ПериодОкончание,
	|	РаботаСКандидатами.Кандидат.Ответственный КАК ОтветственныйПоРаботеСКандидатом,
	|	РаботаСКандидатами.Комментарий КАК Комментарий,
	|	РаботаСКандидатами.Кандидат.Вакансия КАК Вакансия,
	|	РаботаСКандидатами.Кандидат.Вакансия.Ответственный КАК ОтветственныйПоВакансии,
	|	РаботаСКандидатами.Кандидат.Позиция КАК ЦелеваяПозиция,
	|	РаботаСКандидатами.Кандидат.Подразделение КАК ЦелевоеПодразделение
	|ПОМЕСТИТЬ ВТРаботаСКандидатами
	|ИЗ
	|	РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
	|ГДЕ
	|	РаботаСКандидатами.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И РаботаСКандидатами.Период >= &ТекущаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРаботаСКандидатами.ДатаСобытия КАК ДатаСобытия,
	|	ВТРаботаСКандидатами.ДатаСобытияПредставление КАК ДатаСобытияПредставление,
	|	ВТРаботаСКандидатами.Предмет КАК Предмет,
	|	ВТРаботаСКандидатами.ЭтапРаботы КАК ЭтапРаботы,
	|	ВТРаботаСКандидатами.СостояниеЭтапа КАК СостояниеЭтапа,
	|	ВТРаботаСКандидатами.ПериодОкончание КАК ПериодОкончание,
	|	ВТРаботаСКандидатами.ОтветственныйПоРаботеСКандидатом КАК ОтветственныйПоРаботеСКандидатом,
	|	ВТРаботаСКандидатами.Комментарий КАК Комментарий,
	|	ВТРаботаСКандидатами.Вакансия КАК Вакансия,
	|	ВТРаботаСКандидатами.ОтветственныйПоВакансии КАК ОтветственныйПоВакансии,
	|	ВТРаботаСКандидатами.ЦелеваяПозиция КАК ЦелеваяПозиция,
	|	ВТРаботаСКандидатами.ЦелевоеПодразделение КАК ЦелевоеПодразделение
	|ИЗ
	|	ВТРаботаСКандидатами КАК ВТРаботаСКандидатами");
	
	Если Отборы.Количество() > 0 Тогда
		ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[1].Операторы[0].Отбор;
		Для Каждого СтрокаОтбора Из Отборы Цикл
			Если СтрокаОтбора.Использование Тогда
				ТекстУсловия = УведомленияСервер.ПредставлениеУсловияДляЗапроса(
					СтрокаОтбора.ВидСравнения,
					СтрокаОтбора.ЛевоеЗначение,
					"ВТРаботаСКандидатами." + СтрокаОтбора.ЛевоеЗначение);
				ОтборЗапроса.Добавить(ТекстУсловия);
				Запрос.УстановитьПараметр(СтрокаОтбора.ЛевоеЗначение, СтрокаОтбора.ПравоеЗначение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ТаблицаДанных = Результат.Выгрузить();
		
		ПараметрыСобытия = Новый Структура();
		Для Каждого КолонкаРезультата Из СхемаЗапроса.ПакетЗапросов[0].Колонки Цикл
			ПараметрыСобытия.Вставить(КолонкаРезультата.Псевдоним);
		КонецЦикла;
		ПараметрыСобытия.Вставить("ВремяСобытия");
		Для Каждого СтрокаРезультатаЗапроса Из ТаблицаДанных Цикл
			СтрокаТаблицы = ТаблицаРезультата.Добавить();
			СтрокаТаблицы.Предмет = СтрокаРезультатаЗапроса.Предмет;
			СтрокаТаблицы.ДатаСобытия = СтрокаРезультатаЗапроса.ДатаСобытия;
			ЗаполнитьЗначенияСвойств(ПараметрыСобытия, СтрокаРезультатаЗапроса);
			ПараметрыСобытия.ВремяСобытия = Формат(СтрокаРезультатаЗапроса.ДатаСобытия, "ДФ=HH:mm");
			ПараметрыСобытия.ДатаСобытияПредставление = Формат(СтрокаРезультатаЗапроса.ДатаСобытия, "ДЛФ=D");
			СтрокаТаблицы.ПараметрыСобытия = ПараметрыСобытия;
		КонецЦикла;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Заполняет параметры вида уведомления "Назначена новая задача"
//
// Параметры:
//  ОписаниеДанных - Структура - Содержит элементы, описывающий вид уведомления
//    * ТипПредмета - ОписаниеТипов - указывает тип предмета уведомления
//    * Отборы - ТаблицаЗначений - описывает отборы, которые будут доступны пользователю, при настройке рассылки
//        * Имя - Строка - Имя поля отбора, должно быть уникально в пределах таблицы отборов
//                         и совпадать с одним из полей данных уведомления
//        * Представление - Строка - пользовательское представление поля отбора
//        * ОписаниеТипов - ОписаниеТипов - тип значения отбора
//    * Получатели - ТаблицаЗначений - описывает получателей, предлагаемых разработчиком.
//                                 Значение получателей будет выбрано из данных уведомления
//        * Имя - Строка - Имя поля получателя, должно быть уникально в пределах таблицы отборов
//                         и совпадать с одним из полей данных уведомления
//        * Представление - Строка - пользовательское представление получателя
//        * ОписаниеТипов - ОписаниеТипов - тип значения получателя
//
Процедура ИнициализацияВидаУведомленияНоваяЗадачаИсполнителя(ОписаниеДанных) Экспорт
	
	ОписаниеДанных.ТипПредмета = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "Предмет", НСтр("ru = 'Исполнитель'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Исполнитель", 		НСтр("ru = 'Исполнитель'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Важность", 		НСтр("ru = 'Важность'"), Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыВажностиЗадачи"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Исполнитель", 	НСтр("ru = 'Исполнитель'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
КонецПроцедуры

// Процедура заполняет таблицу уведомлений по переданным параметрам и отборам.
//
// Параметры:
//    СтруктураПериода - Структура - два элемента - НачалоПериода и ОкончаниеПериода
//    Отборы - ТаблицаЗначений - перечень отборов событий, заданный пользователем
//       * ЛевоеЗначение - Строка - имя поля отбора в источнике данных.
//       * ВидСравнения - ВидСравнения - Вид сравнения
//       * ЛевоеЗначение - Булево, Число, Строка, Дата, ЛюбаяСсылка - значение отбора.
//    ТаблицаРезультата - ТаблицаЗначений - содержит события изменения объекта.
//
Процедура ПолучениеДанныхВидаУведомленияНоваяЗадачаИсполнителя(СтруктураПериода, Отборы, ТаблицаРезультата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПериода.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", СтруктураПериода.ОкончаниеПериода);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
	|	ВЫРАЗИТЬ(ЗадачаИсполнителя.Исполнитель КАК Справочник.Пользователи).ФизическоеЛицо КАК Предмет,
	|	ЗадачаИсполнителя.Дата КАК Дата,
	|	ЗадачаИсполнителя.СрокИсполнения КАК СрокИсполнения,
	|	ЗадачаИсполнителя.Описание КАК Описание,
	|	ЗадачаИсполнителя.Важность КАК Важность,
	|	ЗадачаИсполнителя.АвторСтрокой КАК АвторСтрокой
	|ПОМЕСТИТЬ ВТЗадачи
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	ЗадачаИсполнителя.Дата >= &ТекущаяДата
	|	И ЗадачаИсполнителя.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И НЕ ЗадачаИсполнителя.Выполнена
	|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗадачи.Исполнитель КАК Исполнитель,
	|	ВТЗадачи.Дата КАК ДатаСобытия,
	|	ВТЗадачи.Предмет КАК Предмет,
	|	ВТЗадачи.Дата КАК ДатаНазначения,
	|	ВТЗадачи.СрокИсполнения КАК СрокИсполнения,
	|	ВТЗадачи.Описание КАК Описание,
	|	ВТЗадачи.Важность КАК Важность,
	|	ВТЗадачи.АвторСтрокой КАК Автор
	|ИЗ
	|	ВТЗадачи КАК ВТЗадачи");
	
	Если Отборы.Количество() > 0 Тогда
		ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[1].Операторы[0].Отбор;
		Для Каждого СтрокаОтбора Из Отборы Цикл
			Если СтрокаОтбора.Использование Тогда
				ТекстУсловия = УведомленияСервер.ПредставлениеУсловияДляЗапроса(
					СтрокаОтбора.ВидСравнения,
					СтрокаОтбора.ЛевоеЗначение,
					"ВТЗадачи." + СтрокаОтбора.ЛевоеЗначение);
				ОтборЗапроса.Добавить(ТекстУсловия);
				Запрос.УстановитьПараметр(СтрокаОтбора.ЛевоеЗначение, СтрокаОтбора.ПравоеЗначение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДанных = РезультатЗапроса.Выгрузить();
	
	ПараметрыСобытия = Новый Структура();
	
	Для Каждого КолонкаРезультата Из РезультатЗапроса.Колонки Цикл
		ПараметрыСобытия.Вставить(КолонкаРезультата.Имя);
	КонецЦикла;
	ПараметрыСобытия.Вставить("ДатаНазначенияПредставление");
	ПараметрыСобытия.Вставить("ВремяНазначенияПредставление");
	
	Для Каждого СтрокаРезультатаЗапроса Из ТаблицаДанных Цикл
		СтрокаТаблицы = ТаблицаРезультата.Добавить();
		СтрокаТаблицы.Предмет = СтрокаРезультатаЗапроса.Предмет;
		СтрокаТаблицы.ДатаСобытия = СтрокаРезультатаЗапроса.ДатаСобытия;
		ЗаполнитьЗначенияСвойств(ПараметрыСобытия, СтрокаРезультатаЗапроса);
		ПараметрыСобытия.ВремяНазначенияПредставление = Формат(СтрокаРезультатаЗапроса.ДатаСобытия, "ДФ=HH:mm");
		ПараметрыСобытия.ДатаНазначенияПредставление = Формат(СтрокаРезультатаЗапроса.ДатаСобытия, "ДЛФ=D");
		СтрокаТаблицы.ПараметрыСобытия = ПараметрыСобытия;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет параметры вида уведомления "Истечение срока исполнения задачи"
// 
// Параметры:
//  ОписаниеДанных - Структура - Содержит элементы, описывающий вид уведомления
//    * ТипПредмета - ОписаниеТипов - указывает тип предмета уведомления
//    * Отборы - ТаблицаЗначений - описывает отборы, которые будут доступны пользователю, при настройке рассылки
//        * Имя - Строка - Имя поля отбора, должно быть уникально в пределах таблицы отборов
//                         и совпадать с одним из полей данных уведомления
//        * Представление - Строка - пользовательское представление поля отбора
//        * ОписаниеТипов - ОписаниеТипов - тип значения отбора
//    * Получатели - ТаблицаЗначений - описывает получателей, предлагаемых разработчиком.
//                                 Значение получателей будет выбрано из данных уведомления
//        * Имя - Строка - Имя поля получателя, должно быть уникально в пределах таблицы отборов
//                         и совпадать с одним из полей данных уведомления
//        * Представление - Строка - пользовательское представление получателя
//        * ОписаниеТипов - ОписаниеТипов - тип значения получателя
//
Процедура ИнициализацияВидаУведомленияИстечениеСрокаИсполненияЗадачи(ОписаниеДанных) Экспорт
	
	ОписаниеДанных.ТипПредмета = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "Предмет", НСтр("ru = 'Исполнитель'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Исполнитель", 		НСтр("ru = 'Исполнитель'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Важность", 		НСтр("ru = 'Важность'"), Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыВажностиЗадачи"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Исполнитель", 	НСтр("ru = 'Исполнитель'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
КонецПроцедуры

// Процедура заполняет таблицу уведомлений по переданным параметрам и отборам.
//
// Параметры:
//    СтруктураПериода - Структура - два элемента - НачалоПериода и ОкончаниеПериода
//    Отборы - ТаблицаЗначений - перечень отборов событий, заданный пользователем
//       * ЛевоеЗначение - Строка - имя поля отбора в источнике данных.
//       * ВидСравнения - ВидСравнения - Вид сравнения
//       * ЛевоеЗначение - Булево, Число, Строка, Дата, ЛюбаяСсылка - значение отбора.
//    ТаблицаРезультата - ТаблицаЗначений - содержит события изменения объекта.
//
Процедура ПолучениеДанныхВидаУведомленияИстечениеСрокаИсполненияЗадачи(СтруктураПериода, Отборы, ТаблицаРезультата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПериода.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", СтруктураПериода.ОкончаниеПериода);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
	|	ВЫРАЗИТЬ(ЗадачаИсполнителя.Исполнитель КАК Справочник.Пользователи).ФизическоеЛицо КАК Предмет,
	|	ЗадачаИсполнителя.Дата КАК Дата,
	|	ЗадачаИсполнителя.СрокИсполнения КАК СрокИсполнения,
	|	ЗадачаИсполнителя.Описание КАК Описание,
	|	ЗадачаИсполнителя.Важность КАК Важность,
	|	ЗадачаИсполнителя.АвторСтрокой КАК АвторСтрокой
	|ПОМЕСТИТЬ ВТЗадачи
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	ЗадачаИсполнителя.СрокИсполнения МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И НЕ ЗадачаИсполнителя.Выполнена
	|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗадачи.Исполнитель КАК Исполнитель,
	|	ВТЗадачи.СрокИсполнения КАК ДатаСобытия,
	|	ВТЗадачи.Предмет КАК Предмет,
	|	ВТЗадачи.Дата КАК ДатаНазначения,
	|	ВТЗадачи.СрокИсполнения КАК СрокИсполнения,
	|	ВТЗадачи.Описание КАК Описание,
	|	ВТЗадачи.Важность КАК Важность,
	|	ВТЗадачи.АвторСтрокой КАК Автор
	|ИЗ
	|	ВТЗадачи КАК ВТЗадачи");
	
	Если Отборы.Количество() > 0 Тогда
		ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[1].Операторы[0].Отбор;
		Для Каждого СтрокаОтбора Из Отборы Цикл
			Если СтрокаОтбора.Использование Тогда
				ТекстУсловия = УведомленияСервер.ПредставлениеУсловияДляЗапроса(
					СтрокаОтбора.ВидСравнения,
					СтрокаОтбора.ЛевоеЗначение,
					"ВТЗадачи." + СтрокаОтбора.ЛевоеЗначение);
				ОтборЗапроса.Добавить(ТекстУсловия);
				Запрос.УстановитьПараметр(СтрокаОтбора.ЛевоеЗначение, СтрокаОтбора.ПравоеЗначение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДанных = РезультатЗапроса.Выгрузить();
	
	ПараметрыСобытия = Новый Структура();
	
	Для Каждого КолонкаРезультата Из РезультатЗапроса.Колонки Цикл
		ПараметрыСобытия.Вставить(КолонкаРезультата.Имя);
	КонецЦикла;
	ПараметрыСобытия.Вставить("ДатаНазначенияПредставление");
	ПараметрыСобытия.Вставить("ВремяНазначенияПредставление");
	
	Для Каждого СтрокаРезультатаЗапроса Из ТаблицаДанных Цикл
		СтрокаТаблицы = ТаблицаРезультата.Добавить();
		СтрокаТаблицы.Предмет = СтрокаРезультатаЗапроса.Предмет;
		СтрокаТаблицы.ДатаСобытия = СтрокаРезультатаЗапроса.ДатаСобытия;
		ЗаполнитьЗначенияСвойств(ПараметрыСобытия, СтрокаРезультатаЗапроса);
		ПараметрыСобытия.ВремяНазначенияПредставление = Формат(СтрокаРезультатаЗапроса.ДатаСобытия, "ДФ=HH:mm");
		ПараметрыСобытия.ДатаНазначенияПредставление = Формат(СтрокаРезультатаЗапроса.ДатаСобытия, "ДЛФ=D");
		СтрокаТаблицы.ПараметрыСобытия = ПараметрыСобытия;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриНачальномЗаполненииЭтапРаботыСКандидатом()
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("ЭтапРаботыСКандидатом");
	Если Не ЗначениеЗаполнено(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	Если УведомленияСервер.ЕстьРассылкиПоВидуУведомления(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыШаблона = Новый Структура();
	
	ПараметрыШаблона.Вставить("ВладелецШаблона", ВидУведомления);
	ПараметрыШаблона.Вставить("ПредназначенДляSMS", Истина);
	ПараметрыШаблона.Вставить("ПредназначенДляВводаНаОсновании", Истина);
	ПараметрыШаблона.Вставить("Текст", НСтр("ru='Здравствуйте. Настоящим подтверждаем приглашение на [ДанныеУведомления.ЭтапРаботы], которое состоится [ДанныеУведомления.ДатаСобытия{ДЛФ=D}] в [ДанныеУведомления.ВремяСобытия].
		|С уважением, [ДанныеУведомления.ОтветственныйПоРаботеСКандидатом]'"));
	ПараметрыШаблона.Вставить("ПолноеИмяТипаПараметраВводаНаОсновании", "Справочник.Кандидаты");
	ПараметрыШаблона.Вставить("Назначение", "Кандидаты");
	
	ШаблонСообщенияСсылка = ШаблоныСообщений.СоздатьШаблон(НСтр("ru='Уведомление кандидату о собеседовании'"), ПараметрыШаблона);
	
	// 	Рассылка уведомления
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления 	= ВидУведомления;
	РассылкаОбъект.ВидТранспорта 	= Перечисления.ВидыТранспортаУведомлений.SMS;
	РассылкаОбъект.Наименование 	= НСтр("ru='Уведомление кандидату о собеседовании'");
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонСообщенияСсылка;
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ДоСобытия;
	РассылкаОбъект.ИнтервалУведомления = 3;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	
	// Отборы
	ЭтапСобеседование = Справочники.ЭтапыРаботыСКандидатами.НайтиПоНаименованию("Собеседование");
	Если ЗначениеЗаполнено(ЭтапСобеседование) Тогда
		НастройкиОтборов = Новый ТаблицаЗначений;
		НастройкиОтборов.Колонки.Добавить("ЛевоеЗначение");
		НастройкиОтборов.Колонки.Добавить("ВидСравнения");
		НастройкиОтборов.Колонки.Добавить("ПравоеЗначение");
		НастройкиОтборов.Колонки.Добавить("Использование");
		НастройкиОтборов.Колонки.Добавить("ОписаниеТипов");
		НастройкиОтборов.Колонки.Добавить("Представление");
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "ЭтапРаботы";
		СтрокаОтбора.ПравоеЗначение = ЭтапСобеседование;
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.Использование = Истина;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ЭтапыРаботыСКандидатами");
		СтрокаОтбора.Представление = НСтр("ru='Этап работы'");
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "СостояниеЭтапа";
		СтрокаОтбора.ПравоеЗначение = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован;
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.Использование = Истина;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЭтаповРаботыСКандидатами");
		СтрокаОтбора.Представление = НСтр("ru='Состояние этапа'");
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "ЦелеваяПозиция";
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание");
		СтрокаОтбора.Представление = НСтр("ru='Целевая позиция'");
		СтрокаОтбора.ПравоеЗначение 	= СтрокаОтбора.ОписаниеТипов.ПривестиЗначение();
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "ЦелевоеПодразделение";
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
		СтрокаОтбора.Представление = НСтр("ru='Целевое подразделение'");
		СтрокаОтбора.ПравоеЗначение 	= СтрокаОтбора.ОписаниеТипов.ПривестиЗначение();
		
		РассылкаОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтборов);
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура ПриНачальномЗаполненииНоваяЗадачаИсполнителя()
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("НоваяЗадачаИсполнителя");
	Если Не ЗначениеЗаполнено(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	Если УведомленияСервер.ЕстьРассылкиПоВидуУведомления(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
	ПараметрыШаблона.Тема = НСтр("ru = 'Назначена новая задача'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:1223-выкл. Личные местоимения используются в текстах шаблонов
	ПараметрыШаблона.Текст = НСтр("ru = 'Вам назначена новая задача [ДанныеУведомления.ДатаНазначенияПредставление]:
			|[ДанныеУведомления.Описание]'");
	// АПК:1223-вкл.
	
	ШаблонСообщенияСсылка = ШаблоныСообщений.СоздатьШаблон(ПараметрыШаблона.Тема, ПараметрыШаблона);
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления 	= ВидУведомления;
	РассылкаОбъект.ВидТранспорта 	= Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.Наименование 	= НСтр("ru = 'Назначена новая задача'");
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонСообщенияСсылка;
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура ПриНачальномЗаполненииИстечениеСрокаИсполненияЗадачи()
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("ИстечениеСрокаИсполненияЗадачи");
	Если Не ЗначениеЗаполнено(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	Если УведомленияСервер.ЕстьРассылкиПоВидуУведомления(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
	ПараметрыШаблона.Тема = НСтр("ru = 'Истечение срока исполнения назначенной задачи'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	ПараметрыШаблона.Текст = НСтр("ru = 'По назначенной задаче истекает срок исполнения [ДанныеУведомления.СрокИсполнения]
		|Описание задачи:
		|[ДанныеУведомления.Описание]'");
	
	ШаблонСообщенияСсылка = ШаблоныСообщений.СоздатьШаблон(ПараметрыШаблона.Тема, ПараметрыШаблона);
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления 	= ВидУведомления;
	РассылкаОбъект.ВидТранспорта 	= Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.Наименование 	= НСтр("ru = 'Истечение срока исполнения назначенной задачи'");
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонСообщенияСсылка;
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

#КонецОбласти
